final List<Map<String, dynamic>> routersMock = [
  {
    'day': 'monday',
    'marketCenterIds': [
      'TT-001', // Мегаполис
      'TT-003', // Атриум
      'TT-005', // Метрополис
      'TT-007', // Сити
      'TT-009', // Гранд
    ],
  },
  {
    'day': 'tuesday',
    'marketCenterIds': [
      'TT-002', // Галерея
      'TT-004', // Плаза
      'TT-006', // Глобус
      'TT-008', // Омега
      'TT-010', // Экспо
    ],
  },
  {
    'day': 'wednesday',
    'marketCenterIds': [
      'TT-011', // Меридиан
      'TT-013', // Галерея
      'TT-015', // Плаза
      'TT-017', // Омега
      'TT-019', // Экспо
    ],
  },
  {
    'day': 'thursday',
    'marketCenterIds': [
      'TT-001', // Мегаполис (повтор)
      'TT-003', // Атриум (повтор)
      'TT-012', // Форум
      'TT-014', // Метрополь
      'TT-016', // Сити
    ],
  },
  {
    'day': 'friday',
    'marketCenterIds': [
      'TT-002', // Галерея (повтор)
      'TT-004', // Плаза (повтор)
      'TT-018', // Гранд
      'TT-020', // Меридиан
      'TT-005', // Метрополис (повтор)
    ],
  },
  {
    'day': 'saturday',
    'marketCenterIds': [
      'TT-006', // Глобус (повтор)
      'TT-008', // Омега (повтор)
      'TT-010', // Экспо (повтор)
      'TT-012', // Форум (повтор)
      'TT-014', // Метрополь (повтор)
    ],
  },
  {
    'day': 'sunday',
    'marketCenterIds': [
      'TT-016', // Сити (повтор)
      'TT-018', // Гранд (повтор)
      'TT-020', // Меридиан (повтор)
      'TT-001', // Мегаполис (повтор)
      'TT-003', // Атриум (повтор)
    ],
  },
];
